jessejhein/Freetos_posix/platform/dspic33E/drivers/uart/uart.c
/**
 * \addtogroup drivers Drivers
 * @{
 * 
 * Implementation of Drivers for DsPic
 */

/**
 * \defgroup uart UART
 * @{
 */

/**
 * \file
 * UART Driver
 * \author Sam Hui <sam_hui@amonics.com>
 * \remarks Copyright (c) 2013 Amonics
 */

/*
 * Copyright (C) 2007-2011  Dennis Tsang <dennis@amonics.com>
 *
 * This file is part of freertos_posix.
 *
 * freertos_posix is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Lesser General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * freertos_posix is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with freertos_posix.  If not, see <http://www.gnu.org/licenses/>
 */

#include <define.h>
#include <fcntl.h>
#include <errno.h>
#include <cirbuf.h>
#include <termios.h>
#include <sys/ioctl.h>


//------------------------------------------------------------------------
/** factor applied to speed to save memory */
#define BAUDRATE_FACTOR                         (9600)
//------------------------------------------------------------------------


//------------------------------------------------------------------------
#if (UART0_RX_BUF_SIZE == 0)
  #define UART0_RX_ENABLE                       0
#else /* UART0_RX_BUF_SIZE > 0 */
  #define UART0_RX_ENABLE                       1
#endif /* UART0_RX_BUF_SIZE > 0 */
#if (UART0_TX_BUF_SIZE == 0)
  #define UART0_TX_ENABLE                       0
#else /* UART0_TX_BUF_SIZE > 0 */
  #define UART0_TX_ENABLE                       1
#endif /* UART0_TX_BUF_SIZE > 0 */

#if (UART1_RX_BUF_SIZE == 0)
  #define UART1_RX_ENABLE                       0
#else /* UART1_RX_BUF_SIZE > 0 */
  #define UART1_RX_ENABLE                       1
#endif /* UART1_RX_BUF_SIZE > 0 */
#if (UART1_TX_BUF_SIZE == 0)
  #define UART1_TX_ENABLE                       0
#else /* UART1_TX_BUF_SIZE > 0 */
  #define UART1_TX_ENABLE                       1
#endif /* UART1_TX_BUF_SIZE > 0 */

#if (UART2_RX_BUF_SIZE == 0)
  #define UART2_RX_ENABLE                       0
#else /* UART2_RX_BUF_SIZE > 0 */
  #define UART2_RX_ENABLE                       1
#endif /* UART2_RX_BUF_SIZE > 0 */
#if (UART2_TX_BUF_SIZE == 0)
  #define UART2_TX_ENABLE                       0
#else /* UART2_TX_BUF_SIZE > 0 */
  #define UART2_TX_ENABLE                       1
#endif /* UART2_TX_BUF_SIZE > 0 */


//------------------------------------------------------------------------
// allocated TX/RX buffers for UART0 (UART_A) as configured
#if (UART0_RX_ENABLE == 1)
/** UART0 RX buffer */
__u8 uart0_rx_buf[UART0_RX_BUF_SIZE];
#endif /* UART0_RX_ENABLE */
#if (UART0_TX_ENABLE == 1)
/** UART0 TX buffer */
__u8 uart0_tx_buf[UART0_TX_BUF_SIZE];
#endif /* UART0_TX_ENABLE */

// allocated TX/RX buffers for UART1 (UART_B) as configured
#if (UART1_RX_ENABLE == 1)
/** UART1 RX buffer */
__u8 uart1_rx_buf[UART1_RX_BUF_SIZE];
#endif /* UART1_RX_ENABLE */
#if (UART1_TX_ENABLE == 1)
/** UART1 TX buffer */
__u8 uart1_tx_buf[UART1_TX_BUF_SIZE];
#endif /* UART1_TX_ENABLE */

// allocated TX/RX buffers for UART2 (UART_C) as configured
#if (UART2_RX_ENABLE == 1)
/** UART2 RX buffer */
__u8 uart2_rx_buf[UART2_RX_BUF_SIZE];
#endif /* UART2_RX_ENABLE */
#if (UART2_TX_ENABLE == 1)
/** UART2 TX buffer */
__u8 uart2_tx_buf[UART2_TX_BUF_SIZE];
#endif /* UART2_TX_ENABLE */


//------------------------------------------------------------------------
/** data structure to store UART configuration */
struct UART_DATA
{
  //setting
  tcflag_t cflag;
  __u8 io_flag;
  //RX
  __u8 rx_wr;
  __u8 rx_rd;
  __u8 rx_buf_size;
  __u8* rx_buf;
  //TX
  __u8 tx_done;
  __u8 tx_wr;
  __u8 tx_rd;
  __u8 tx_buf_size;
  __u8* tx_buf;
};
static struct UART_DATA uart[NO_OF_UART];


//------------------------------------------------------------------------
/*
 * Local Functions
 */
static void uart0_init (void);
#if (NO_OF_UART > 1)
static void uart1_init (void);
#endif /* NO_OF_UART > 1 */
#if (NO_OF_UART > 2)
static void uart2_init (void);
#endif /* NO_OF_UART > 2 */


//------------------------------------------------------------------------
int
uart_open (int device, int flags)
{
  //map pins for UART modules (PPS). Required on dsPic33E platform
  uart_pin_init ();

  switch (device)
    {
      case 0:
        {
          //=====================================================
  #if (UART0_RX_ENABLE == 1)
          uart[0].rx_wr = 0;
          uart[0].rx_rd = 0;
          uart[0].rx_buf = &uart0_rx_buf[0];
          uart[0].rx_buf_size = UART0_RX_BUF_SIZE;
  #endif /* UART0_RX_ENABLE */
          //=====================================================
  #if (UART0_TX_ENABLE == 1)
          uart[0].tx_wr = 0;
          uart[0].tx_rd = 0;
          uart[0].tx_done = 1;
          uart[0].tx_buf = &uart0_tx_buf[0];
          uart[0].tx_buf_size = UART0_TX_BUF_SIZE;
  #endif /* UART0_TX_ENABLE */
          //=====================================================
          uart[0].io_flag = (__u8) flags;
          //=====================================================
          uart[0].cflag = 0;
          //[8-bit]
          uart[0].cflag &= ~CSIZE;
          uart[0].cflag |= CS8;
          //[Parity bit]
  #if (UART0_PARITYBIT == 2)
          uart[0].cflag |= PARENB;
          uart[0].cflag &= ~PARODD;
  #elif (UART0_PARITYBIT == 1)
          uart[0].cflag |= PARENB;
          uart[0].cflag |= PARODD;
  #else /* NO_PARITY */
          uart[0].cflag &= ~PARENB;
  #endif /* NO_PARITY */
          //[Stop bit]
  #if (UART0_STOPBIT == 2)
          uart[0].cflag |= CSTOPB;
  #else /** 1_STOP_BIT */
          uart[0].cflag &= ~CSTOPB;
#endif /** 1_STOP_BIT */
          uart[0].cflag |= (0x1F & (__u16)(UART0_BAUDRATE / BAUDRATE_FACTOR));
          uart0_init ();
          //=====================================================
          break;
        }

#if (NO_OF_UART > 1)
      case 1:
        {
          //=====================================================
  #if (UART1_RX_ENABLE == 1)
          uart[1].rx_wr = 0;
          uart[1].rx_rd = 0;
          uart[1].rx_buf = &uart1_rx_buf[0];
          uart[1].rx_buf_size = UART1_RX_BUF_SIZE;
  #endif /* UART1_RX_ENABLE */
          //=====================================================
  #if (UART1_TX_ENABLE == 1)
          uart[1].tx_wr = 0;
          uart[1].tx_rd = 0;
          uart[1].tx_done = 1;
          uart[1].tx_buf = &uart1_tx_buf[0];
          uart[1].tx_buf_size = UART1_TX_BUF_SIZE;
  #endif /* UART1_TX_ENABLE */
          //=====================================================
          uart[1].io_flag = (__u8) flags;
          //=====================================================
          uart[1].cflag = 0;
          //[8-bit]
          uart[1].cflag &= ~CSIZE;
          uart[1].cflag |= CS8;
          //[Parity bit]
  #if (UART1_PARITYBIT == 2)
          uart[1].cflag |= PARENB;
          uart[1].cflag &= ~PARODD;
  #elif (UART1_PARITYBIT == 1)
          uart[1].cflag |= PARENB;
          uart[1].cflag |= PARODD;
  #else /* NO_PARITY */
          uart[1].cflag &= ~PARENB;
  #endif /* NO_PARITY */
          //[Stop bit]
  #if (UART1_STOPBIT == 2)
          uart[1].cflag |= CSTOPB;
  #else /** 1_STOP_BIT */
          uart[1].cflag &= ~CSTOPB;
  #endif /** 1_STOP_BIT */
          uart[1].cflag |= (0x1F & (__u16)(UART1_BAUDRATE / BAUDRATE_FACTOR));
          uart1_init ();
          //=====================================================
          break;
        }
#endif /* NO_OF_UART > 1 */

#if (NO_OF_UART > 2)
      case 2:
        {
          //=====================================================
  #if (UART2_RX_ENABLE == 1)
          uart[2].rx_wr = 0;
          uart[2].rx_rd = 0;
          uart[2].rx_buf = &uart2_rx_buf[0];
          uart[2].rx_buf_size = UART2_RX_BUF_SIZE;
  #endif /* UART2_RX_ENABLE */
          //=====================================================
  #if (UART2_TX_ENABLE == 1)
          uart[2].tx_wr = 0;
          uart[2].tx_rd = 0;
          uart[2].tx_done = 1;
          uart[2].tx_buf = &uart2_tx_buf[0];
          uart[2].tx_buf_size = UART2_TX_BUF_SIZE;
  #endif /* UART2_TX_ENABLE */
          //=====================================================
          uart[2].io_flag = (__u8) flags;
          //=====================================================
          uart[2].cflag = 0;
          //[8-bit]
          uart[2].cflag &= ~CSIZE;
          uart[2].cflag |= CS8;
          //[Parity bit]
  #if (UART1_PARITYBIT == 2)
          uart[2].cflag |= PARENB;
          uart[2].cflag &= ~PARODD;
  #elif (UART1_PARITYBIT == 1)
          uart[2].cflag |= PARENB;
          uart[2].cflag |= PARODD;
  #else /* NO_PARITY */
          uart[2].cflag &= ~PARENB;
  #endif /* NO_PARITY */
          //[Stop bit]
  #if (UART1_STOPBIT == 2)
          uart[2].cflag |= CSTOPB;
  #else /** 1_STOP_BIT */
          uart[2].cflag &= ~CSTOPB;
  #endif /** 1_STOP_BIT */
          uart[2].cflag |= (0x1F & (__u16)(UART2_BAUDRATE / BAUDRATE_FACTOR));
          uart2_init ();
          //=====================================================
          break;
        }
#endif /* NO_OF_UART > 2 */

      default:
        {
          return -1;
        }
    }
  return 0;
}



