jessejhein/Freetos_posix/platform/dspic33E/drivers/uart/uart.c
/*
 * UARTx initialisation
 */
//-------------------------------------------------------------------------------------
static void 
uart0_init (void)
{
  UART_A_RS485_CTL_EN ();
  //=============================================================================
  // Configure Baud rate
  __u32 speed = (uart[0].cflag & 0x1F) * (__u32)BAUDRATE_FACTOR;
  U1BRG = GEN_UART_BAUDRATE (speed);
  //==============================================================================
  // Configure Mode [Default: 8N1]
  U1MODE = 0x0000;
  if (uart[0].cflag & PARENB)
    {
      //Odd Parity
      if (uart[0].cflag & PARODD) U1MODEbits.PDSEL = 2;
      //Even Parity
      else U1MODEbits.PDSEL = 1;
    }
  if (uart[0].cflag & CSTOPB)
    {
      //2 Stop bits
      U1MODEbits.STSEL = 1;
    }
  //==============================================================================
  // Configure Interrupt
#if (UART0_RX_ENABLE == 1)
  _U1RXIF = 0;                //Clear RX interrupt flags
  _U1RXIE = 1;                //Receive interrupt: 0 disable, 1 enable
  U1STAbits.URXISEL0 = 0;     //RX Interrupt when a character is received
  U1STAbits.URXISEL1 = 0;
#endif /* UART0_RX_ENABLE */
#if (UART0_TX_ENABLE == 1)
  _U1TXIF = 0;                //Clear TX interrupt flags
  _U1TXIE = 1;                //Transmit interrupt: 0 disable, 1 enable
  U1STAbits.UTXISEL0 = 1;     //TX Interrupt when all TX is completed
  U1STAbits.UTXISEL1 = 0;
#endif /* UART0_TX_ENABLE */
  //==============================================================================
  // Enable U0ART module
  U1MODEbits.UARTEN = 1;
#if (UART0_TX_ENABLE == 1)
  //==============================================================================
  // Enable Transmit
  U1STAbits.UTXEN = 1;
#endif /* UART0_TX_ENABLE */
}

#if (NO_OF_UART > 1)
static void 
uart1_init (void)
{
  UART_B_RS485_CTL_EN ();
  //=============================================================================
  // Configure Baud rate
  __u32 speed = (uart[1].cflag & 0x1F) * (__u32)BAUDRATE_FACTOR;
  U2BRG = GEN_UART_BAUDRATE (speed);
  //==============================================================================
  // Configure Mode [Default: 8N1]
  U2MODE = 0x0000;
  if (uart[1].cflag & PARENB)
    {
      //Odd Parity
      if (uart[1].cflag & PARODD) U2MODEbits.PDSEL = 2;
      //Even Parity
      else U2MODEbits.PDSEL = 1;
    }
  if (uart[1].cflag & CSTOPB)
    {
      //2 Stop bits
      U2MODEbits.STSEL = 1;
    }
  //==============================================================================
  // Configure Interrupt
#if (UART1_RX_ENABLE == 1)
  _U2RXIF = 0;                //Clear RX interrupt flags
  _U2RXIE = 1;                //Receive interrupt: 0 disable, 1 enable
  U2STAbits.URXISEL0 = 0;     //RX Interrupt when a character is received
  U2STAbits.URXISEL1 = 0;
#endif /* UART1_RX_ENABLE */
#if (UART1_TX_ENABLE == 1)
  _U2TXIF = 0;                //Clear TX interrupt flags
  _U2TXIE = 1;                //Transmit interrupt: 0 disable, 1 enable
  U2STAbits.UTXISEL0 = 1;     //TX Interrupt when all TX is completed
  U2STAbits.UTXISEL1 = 0;
#endif /* UART1_TX_ENABLE */
  //==============================================================================
  // Enable U1ART module
  U2MODEbits.UARTEN = 1;
#if (UART1_TX_ENABLE == 1)
  //==============================================================================
  // Enable Transmit
  U2STAbits.UTXEN = 1;
#endif /* UART1_TX_ENABLE */
}
#endif /* NO_OF_UART > 1 */

#if (NO_OF_UART > 2)
static void
uart2_init (void)
{
  UART_C_RS485_CTL_EN ();
  //=============================================================================
  // Configure Baud rate
  __u32 speed = (uart[2].cflag & 0x1F) * (__u32)BAUDRATE_FACTOR;
  U3BRG = GEN_UART_BAUDRATE (speed);
  //==============================================================================
  // Configure Mode [Default: 8N1]
  U3MODE = 0x0000;
  if (uart[2].cflag & PARENB)
    {
      //Odd Parity
      if (uart[2].cflag & PARODD) U3MODEbits.PDSEL = 2;
      //Even Parity
      else U3MODEbits.PDSEL = 1;
    }
  if (uart[2].cflag & CSTOPB)
    {
      //2 Stop bits
      U3MODEbits.STSEL = 1;
    }
  //==============================================================================
  // Configure Interrupt
#if (UART2_RX_ENABLE == 1)
  _U3RXIF = 0;                //Clear RX interrupt flags
  _U3RXIE = 1;                //Receive interrupt: 0 disable, 1 enable
  U3STAbits.URXISEL0 = 0;     //RX Interrupt when a character is received
  U3STAbits.URXISEL1 = 0;
#endif /* UART2_RX_ENABLE */
#if (UART2_TX_ENABLE == 1)
  _U3TXIF = 0;                //Clear TX interrupt flags
  _U3TXIE = 1;                //Transmit interrupt: 0 disable, 1 enable
  U3STAbits.UTXISEL0 = 1;     //TX Interrupt when all TX is completed
  U3STAbits.UTXISEL1 = 0;
#endif /* UART2_TX_ENABLE */
  //==============================================================================
  // Enable U2ART module
  U3MODEbits.UARTEN = 1;
#if (UART2_TX_ENABLE == 1)
  //==============================================================================
  // Enable Transmit
  U3STAbits.UTXEN = 1;
#endif /* UART2_TX_ENABLE */
}
#endif /* NO_OF_UART > 2 */



/*
 * UARTx Tx ISR
 */
//-------------------------------------------------------------------------------------
#if (UART0_TX_ENABLE == 1)
/**
 * \brief Transmit Interrupt Handler for dsPic33E U1 module used by U0ART (UART_A)
 * \remarks TX Interrupt when all TX is completed
 * \remarks First interrupt is set manually in uart_write
 */
void _IRQ
_U1TXInterrupt (void)
{
  _U1TXIF = 0;

  __u8 next = cirbuf_rd (uart[0].tx_wr, uart[0].tx_rd, uart[0].tx_buf_size);
  //data available to transmit
  if (next != CIRBUF_RD_EMPTY)
    {
      U1TXREG = (uart[0].tx_buf[uart[0].tx_rd] & 0xFF);
      uart[0].tx_rd = next;
    }
  //no more data to transmit
  else
    {
      while (!U1STAbits.TRMT);  //wait until the last transmission has ended
      UART_A_RS485_TX_OFF ();   //Set transmit pin to Low, i.e. back to receive mode
      uart[0].tx_done = 1;
    }
}
#endif /* UART0_TX_ENABLE */

#if (NO_OF_UART > 1)
#if (UART1_TX_ENABLE == 1)
/**
 * \brief Transmit Interrupt Handler for dsPic33E U2 module used by U1ART (UART_B)
 * \remarks TX Interrupt when all TX is completed
 * \remarks First interrupt is set manually in uart_write
 */
void _IRQ
_U2TXInterrupt (void)
{
  _U2TXIF = 0;

   __u8 next = cirbuf_rd (uart[1].tx_wr, uart[1].tx_rd, uart[1].tx_buf_size);
  //data available to transmit
  if (next != CIRBUF_RD_EMPTY)
    {
      U2TXREG = (uart[1].tx_buf[uart[1].tx_rd] & 0xFF);
      uart[1].tx_rd = next;
    }
  //no more data to transmit
  else
    {
      while (!U2STAbits.TRMT);  //wait until the last transmission has ended
      UART_B_RS485_TX_OFF ();   //Set transmit pin to Low, i.e. back to receive mode
      uart[1].tx_done = 1;
    }
}
#endif /* UART1_TX_ENABLE */
#endif /* NO_OF_UART > 1 */

#if (NO_OF_UART > 2)
#if (UART2_TX_ENABLE == 1)
/**
 * \brief Transmit Interrupt Handler for dsPic33E U3 module used by U2ART (UART_C)
 * \remarks TX Interrupt when all TX is completed
 * \remarks First interrupt is set manually in uart_write
 */
void _IRQ
_U3TXInterrupt (void)
{
  _U3TXIF = 0;

   __u8 next = cirbuf_rd (uart[2].tx_wr, uart[2].tx_rd, uart[2].tx_buf_size);
  //data available to transmit
  if (next != CIRBUF_RD_EMPTY)
    {
      U3TXREG = (uart[2].tx_buf[uart[2].tx_rd] & 0xFF);
      uart[2].tx_rd = next;
    }
  //no more data to transmit
  else
    {
      while (!U3STAbits.TRMT);  //wait until the last transmission has ended
      UART_C_RS485_TX_OFF ();   //Set transmit pin to Low, i.e. back to receive mode
      uart[2].tx_done = 1;
    }
}
#endif /* UART2_TX_ENABLE */
#endif /* NO_OF_UART > 2 */



