jessejhein/Freetos_posix/platform/dspic33E/drivers/uart/uart.c
/*
 * UARTx Rx ISR
 */
//-------------------------------------------------------------------------------------
#if (UART0_RX_ENABLE == 1)
/**
 * \brief Receive Interrupt Handler for dsPic33E U1 module used by U0ART (UART_A)
 * \remarks RX Interrupt when a character is received
 * \remarks Read until the RX buffer is emptied
 */
void _IRQ
_U1RXInterrupt(void)
{
  //1 or more bytes received
  while (U1STAbits.URXDA)
    {
      __u8 next = cirbuf_wr (uart[0].rx_wr, uart[0].rx_rd, uart[0].rx_buf_size);
      //If buffer is not full
      if (next != CIRBUF_WR_FULL)
        {
          uart[0].rx_buf[uart[0].rx_wr] = (__u8) U1RXREG;
          uart[0].rx_wr = next;
        }
      //When buffer is full, still remove data from register, but the incoming data is lost
      else
        {
          next = (__u8) U1RXREG;
        }
    }
  //Rx Buffer Overflow:
  //If this bit is not cleared, the UART module cannot receive more data
  if (U1STAbits.OERR) U1STAbits.OERR = 0;

  _U1RXIF = 0;
}
#endif /* UART0_RX_ENABLE */

#if (NO_OF_UART > 1)
#if (UART1_RX_ENABLE == 1)
/**
 * \brief Receive Interrupt Handler for dsPic33E U2 module used by U1ART (UART_B)
 * \remarks RX Interrupt when a character is received
 * \remarks Read until the RX buffer is emptied
 */
void _IRQ
_U2RXInterrupt(void)
{
  //1 or more bytes received
  while (U2STAbits.URXDA)
    {
      __u8 next = cirbuf_wr (uart[1].rx_wr, uart[1].rx_rd, uart[1].rx_buf_size);
      //If buffer is not full
      if (next != CIRBUF_WR_FULL)
        {
          uart[1].rx_buf[uart[1].rx_wr] = (__u8) U2RXREG;
          uart[1].rx_wr = next;
        }
      //When buffer is full, still remove data from register, but the incoming data is lost
      else
        {
          next = (__u8) U2RXREG;
        }
    }
  //Rx Buffer Overflow:
  //If this bit is not cleared, the UART module cannot receive more data
  if (U2STAbits.OERR) U2STAbits.OERR = 0;

  _U2RXIF = 0;
}
#endif /* UART1_RX_ENABLE */
#endif /* NO_OF_UART > 1 */

#if (NO_OF_UART > 2)
#if (UART2_RX_ENABLE == 1)
/**
 * \brief Receive Interrupt Handler for dsPic33E U3 module used by U2ART (UART_C)
 * \remarks RX Interrupt when a character is received
 * \remarks Read until the RX buffer is emptied
 */
void _IRQ
_U3RXInterrupt(void)
{
  //1 or more bytes received
  while (U3STAbits.URXDA)
    {
      __u8 next = cirbuf_wr (uart[2].rx_wr, uart[2].rx_rd, uart[2].rx_buf_size);
      //If buffer is not full
      if (next != CIRBUF_WR_FULL)
        {
          uart[2].rx_buf[uart[2].rx_wr] = (__u8) U3RXREG;
          uart[2].rx_wr = next;
        }
      //When buffer is full, still remove data from register, but the incoming data is lost
      else
        {
          next = (__u8) U3RXREG;
        }
    }
  //Rx Buffer Overflow:
  //If this bit is not cleared, the UART module cannot receive more data
  if (U3STAbits.OERR) U3STAbits.OERR = 0;

  _U3RXIF = 0;
}
#endif /* UART2_RX_ENABLE */
#endif /* NO_OF_UART > 2 */



//-------------------------------------------------------------------------------------
int
uart_write (int device, __u8* buf, __u16 count)
{
  //Perform write if write operation is enabled
  if ((uart[device].io_flag & O_RDWR) || (uart[device].io_flag & O_WRONLY))
    {
      //If transmit has not completed, wait for it to finish
      while (!uart[device].tx_done);

      //copy data to buffer
      __u16 byte;
      for (byte = 0; byte < count; byte++)
        {
           __u8 next = cirbuf_wr (uart[device].tx_wr, uart[device].tx_rd, uart[device].tx_buf_size);
          //Buffer is not full
          if (next != CIRBUF_WR_FULL)
            {
              uart[device].tx_buf[uart[device].tx_wr] = buf[byte];
              uart[device].tx_wr = next;
            }
          else break;
        }

      //Raise Interrupt flag to initiate transmission
      if (device == 0)
        {
#if (UART0_TX_ENABLE == 1)
          uart[device].tx_done = 0;     //start new transmission
          UART_A_RS485_TX_ON ();        //Set transmit pin to High
          _U1TXIF = 1;                  //Start interrupt
#endif /* UART0_TX_ENABLE */
        }
      else if (device == 1)
        {
#if (UART1_TX_ENABLE == 1)
          uart[device].tx_done = 0;     //start new transmission
          UART_B_RS485_TX_ON ();        //Set transmit pin to High
          _U2TXIF = 1;                  //Start interrupt
#endif /* UART1_TX_ENABLE */
        }
      else
        {
#if (UART2_TX_ENABLE == 1)
          uart[device].tx_done = 0;     //start new transmission
          UART_C_RS485_TX_ON ();        //Set transmit pin to High
          _U3TXIF = 1;                  //Start interrupt
#endif /* UART2_TX_ENABLE */
        }
      return byte;
    }
  //IO not opened for writing
  else
    {
      errno = EBADF;
      return -1;
    }
}



//-------------------------------------------------------------------------------------
int
uart_read (int device, __u8* buf)
{
  //Perform read if read operation is enabled
  if ((uart[device].io_flag & O_RDWR) || !(uart[device].io_flag & O_WRONLY))
    {
       __u8 next = cirbuf_rd (uart[device].rx_wr, uart[device].rx_rd, uart[device].rx_buf_size);
      //Copy 1 byte when data is available
      if (next != CIRBUF_RD_EMPTY)
        {
          *buf = uart[device].rx_buf[uart[device].rx_rd];
          uart[device].rx_rd = next;
          return 1;
        }
      //No data can be copied
      else
        {
          return 0;
        }
    }
  //IO not opened for reading
  else
    {
      errno = EBADF;
      return -1;
    }
}



//-------------------------------------------------------------------------------------
int
uart_close (int device)
{
  switch (device)
    {
      case 0:
        {
#if (UART0_TX_ENABLE == 1)
          //Wait for TX to complete
          while (!U1STAbits.TRMT);
          UART_A_RS485_TX_OFF ();       //Set TX pin to Low, i.e. back to receive mode
          _U1TXIF = 0;                  //Clear TX interrupt flag
          _U1TXIE = 0;                  //Disable TX interrupt
          U1STAbits.UTXEN = 0;          //Disable TX
          uart[0].tx_done = 1;          //Set TX as completed
#endif /* UART0_TX_ENABLE */

#if (UART0_RX_ENABLE == 1)
          //Wait for RX to complete
          while (!U1STAbits.RIDLE);
          _U1RXIF = 0;                  //Clear RX interrupt flag
          _U1RXIE = 0;                  //Disable RX interrupt
#endif /* UART0_RX_ENABLE */
          U1MODEbits.UARTEN = 0;
          break;
        }

#if (NO_OF_UART > 1)
      case 1:
        {
#if (UART1_TX_ENABLE == 1)
          //Wait for TX to complete
          while (!U2STAbits.TRMT);
          UART_B_RS485_TX_OFF ();       //Set TX pin to Low, i.e. back to receive mode
          _U2TXIF = 0;                  //Clear TX interrupt flag
          _U2TXIE = 0;                  //Disable TX interrupt
          U2STAbits.UTXEN = 0;          //Disable TX
          uart[1].tx_done = 1;          //Set TX as completed
#endif /* UART1_TX_ENABLE */

#if (UART1_RX_ENABLE == 1)
          //Wait for RX to complete
          while (!U2STAbits.RIDLE);
          _U2RXIF = 0;                  //Clear RX interrupt flag
          _U2RXIE = 0;                  //Disable RX interrupt
#endif /* UART1_RX_ENABLE */
          U2MODEbits.UARTEN = 0;
          break;
        }
#endif /* NO_OF_UART > 1 */

#if (NO_OF_UART > 2)
      case 2:
        {
#if (UART2_TX_ENABLE == 1)
          //Wait for TX to complete
          while (!U3STAbits.TRMT);
          UART_C_RS485_TX_OFF ();       //Set TX pin to Low, i.e. back to receive mode
          _U3TXIF = 0;                  //Clear TX interrupt flag
          _U3TXIE = 0;                  //Disable TX interrupt
          U3STAbits.UTXEN = 0;          //Disable TX
          uart[2].tx_done = 1;          //Set TX as completed
#endif /* UART2_TX_ENABLE */

#if (UART2_RX_ENABLE == 1)
          //Wait for RX to complete
          while (!U3STAbits.RIDLE);
          _U3RXIF = 0;                  //Clear RX interrupt flag
          _U3RXIE = 0;                  //Disable RX interrupt
#endif /* UART2_RX_ENABLE */
          U3MODEbits.UARTEN = 0;
          break;
        }
#endif /* NO_OF_UART > 2 */

      default:
        {
          return -1;
        }
    }
  return 0;
}



