jessejhein/Freetos_posix/platform/dspic33E/drivers/uart/uart.c
//-------------------------------------------------------------------------------------
int
uart_ioctl (int device, int request, void* argp)
{
  switch (request)
    {
      //set option
      case UART_SET_OPTION:
        {
          switch (device)
            {
              case 0:
                {
                  uart[0].cflag = ((struct termios*)argp)->c_cflag;
                  uart0_init ();
                  break;
                }
#if (NO_OF_UART > 1)
              case 1:
                {
                  uart[1].cflag = ((struct termios*)argp)->c_cflag;
                  uart1_init ();
                  break;
                }
#endif /* NO_OF_UART > 1 */
#if (NO_OF_UART > 2)
              case 2:
                {
                  uart[2].cflag = ((struct termios*)argp)->c_cflag;
                  uart2_init ();
                  break;
                }
#endif /* NO_OF_UART > 2 */
              //UART id not recognised
              default:
                return -1;
            }
        }
      //get baud rate
      case UART_GET_OPTION:
        {
          switch (device)
            {
              case 0:
                {
                  ((struct termios*)argp)->c_cflag = uart[0].cflag;
                  break;
                }
#if (NO_OF_UART > 1)
              case 1:
                {
                  ((struct termios*)argp)->c_cflag = uart[1].cflag;
                  break;
                }
#endif /* NO_OF_UART > 1 */
#if (NO_OF_UART > 2)
              case 2:
                {
                  ((struct termios*)argp)->c_cflag = uart[2].cflag;
                  break;
                }
#endif /* NO_OF_UART > 2 */
              //UART id not recognised
              default:
                return -1;
            }
        }
      //request code not recognised
      default:
        {
          return -1;
        }
    }
  return 0;
}

/** @} */
/** @} */
